# 公众号配置
# 公众号appId
app_id = "wxff8af097e8d8f0e8"
# 公众号appSecret
app_secret = "82d9cbe937cff8ff14a43be722af3b30"
# 模板消息id
# 每日消息
template_id1 = "rg9lZbT8GQYUg1ZAZ7e75jmKOtXBbYPBXd0nFgH-xgg"
# 课程消息,上课提醒
template_id2 = "GOtkUf8DtIH3YrQ-EGT36058wTcPSw2F9LypI-wLses"
# 晚安心语
template_id3 = "qrntW1U935qrRawB2uuhj8HjcT-YyN4e_DcmzDo0XkA"
# 接收公众号消息的微信号
# 这是openid
user = ["oEvMq6p0jYyzwbpS2SMRdJXbcIpM"]

# 信息配置
# 所在省份
province = "辽宁"
# 所在城市
city = "大连"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1，---------倒计时
birthday = "2003-2-28"
# 在一起的日子，格式同上------------计时器
love_date = "2003-2-28"
# 天行数据晚安心语 key
good_Night_Key = "6f422f58d3948b11f7602e1e89aebffe"
# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2024
month = 3
day = 4
# 每日推送时间
post_Time = "07:35:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:40:00", "09:40:00", "13:40:00", "15:40:00", "18:40:00"]
# 课程时间
course_Time = ["8:00--9:55", "10:15--11:50", "13:20--14:55", "15:15--16:50", "18:10--19:45"]
# 晚安心语及第二天课程推送时间
good_Night_Time = "22:55:00"
# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
classes = \
    {
        "1": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "2": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "3": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "4": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "5": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "6": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "7": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "8": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "9": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "10": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "11": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "12": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "13": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "14": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "15": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "16": [
            ['英语国家概况(理论)(1C303)', '高级英语Ⅱ(理论)(1Z306)', '', '', '', ''],
            ['美国文学作品选读(理论)(1Z210)', '', '大学生就业指导(理论)(1C212)', '', '', ''],
            ['英语口译(理论)(1Z210)', '英语语言学(理论)(1C413)', '', '大学生就业指导(理论)(1C212)', '', ''],
            ['大学日语(B)Ⅱ(理论)(1Z207)', '教育学心理(理论)(1Z206)', '', '', '', ''],
            ['高级英语Ⅱ(理论)(1Z306)', '英语笔译Ⅱ(理论)(1Z204)', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
    }

# 模板 1：每日提醒模板
# 本周是开学的第: {{weeks.DATA}} 周
# 今天是: {{date.DATA}}
# 城市： {{city.DATA}}
# 天气： {{weather.DATA}}
# 最低气温: {{min_temperature.DATA}}
# 最高气温: {{max_temperature.DATA}}
# 今天是破壳日的第: {{love_day.DATA}} 天
# 距离开学还有: {{birthday.DATA}} 天
# ----------------今日课程----------------
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}

# 模板 2 课程单推
# 课程信息: {{classInfo.DATA}}

# 模板 3 晚安心语推送和第二天课程推送
# {{goodNight.DATA}}
# ----------------明日课程----------------
# 明天是: {{week.DATA}}
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}
